MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4502-F100K768/mcu.h
/* -----------------------------------  DSD_CLC  ---------------------------------- */
#define DSD_CLC_DISR_Pos                      (0UL)                     /*!< DSD CLC: DISR (Bit 0)                                       */
#define DSD_CLC_DISR_Msk                      (0x1UL)                   /*!< DSD CLC: DISR (Bitfield-Mask: 0x01)                         */
#define DSD_CLC_DISS_Pos                      (1UL)                     /*!< DSD CLC: DISS (Bit 1)                                       */
#define DSD_CLC_DISS_Msk                      (0x2UL)                   /*!< DSD CLC: DISS (Bitfield-Mask: 0x01)                         */
#define DSD_CLC_EDIS_Pos                      (3UL)                     /*!< DSD CLC: EDIS (Bit 3)                                       */
#define DSD_CLC_EDIS_Msk                      (0x8UL)                   /*!< DSD CLC: EDIS (Bitfield-Mask: 0x01)                         */

/* -----------------------------------  DSD_ID  ----------------------------------- */
#define DSD_ID_MOD_REV_Pos                    (0UL)                     /*!< DSD ID: MOD_REV (Bit 0)                                     */
#define DSD_ID_MOD_REV_Msk                    (0xffUL)                  /*!< DSD ID: MOD_REV (Bitfield-Mask: 0xff)                       */
#define DSD_ID_MOD_TYPE_Pos                   (8UL)                     /*!< DSD ID: MOD_TYPE (Bit 8)                                    */
#define DSD_ID_MOD_TYPE_Msk                   (0xff00UL)                /*!< DSD ID: MOD_TYPE (Bitfield-Mask: 0xff)                      */
#define DSD_ID_MOD_NUMBER_Pos                 (16UL)                    /*!< DSD ID: MOD_NUMBER (Bit 16)                                 */
#define DSD_ID_MOD_NUMBER_Msk                 (0xffff0000UL)            /*!< DSD ID: MOD_NUMBER (Bitfield-Mask: 0xffff)                  */

/* -----------------------------------  DSD_OCS  ---------------------------------- */
#define DSD_OCS_SUS_Pos                       (24UL)                    /*!< DSD OCS: SUS (Bit 24)                                       */
#define DSD_OCS_SUS_Msk                       (0xf000000UL)             /*!< DSD OCS: SUS (Bitfield-Mask: 0x0f)                          */
#define DSD_OCS_SUS_P_Pos                     (28UL)                    /*!< DSD OCS: SUS_P (Bit 28)                                     */
#define DSD_OCS_SUS_P_Msk                     (0x10000000UL)            /*!< DSD OCS: SUS_P (Bitfield-Mask: 0x01)                        */
#define DSD_OCS_SUSSTA_Pos                    (29UL)                    /*!< DSD OCS: SUSSTA (Bit 29)                                    */
#define DSD_OCS_SUSSTA_Msk                    (0x20000000UL)            /*!< DSD OCS: SUSSTA (Bitfield-Mask: 0x01)                       */

/* ---------------------------------  DSD_GLOBCFG  -------------------------------- */
#define DSD_GLOBCFG_MCSEL_Pos                 (0UL)                     /*!< DSD GLOBCFG: MCSEL (Bit 0)                                  */
#define DSD_GLOBCFG_MCSEL_Msk                 (0x7UL)                   /*!< DSD GLOBCFG: MCSEL (Bitfield-Mask: 0x07)                    */

/* ---------------------------------  DSD_GLOBRC  --------------------------------- */
#define DSD_GLOBRC_CH0RUN_Pos                 (0UL)                     /*!< DSD GLOBRC: CH0RUN (Bit 0)                                  */
#define DSD_GLOBRC_CH0RUN_Msk                 (0x1UL)                   /*!< DSD GLOBRC: CH0RUN (Bitfield-Mask: 0x01)                    */
#define DSD_GLOBRC_CH1RUN_Pos                 (1UL)                     /*!< DSD GLOBRC: CH1RUN (Bit 1)                                  */
#define DSD_GLOBRC_CH1RUN_Msk                 (0x2UL)                   /*!< DSD GLOBRC: CH1RUN (Bitfield-Mask: 0x01)                    */
#define DSD_GLOBRC_CH2RUN_Pos                 (2UL)                     /*!< DSD GLOBRC: CH2RUN (Bit 2)                                  */
#define DSD_GLOBRC_CH2RUN_Msk                 (0x4UL)                   /*!< DSD GLOBRC: CH2RUN (Bitfield-Mask: 0x01)                    */
#define DSD_GLOBRC_CH3RUN_Pos                 (3UL)                     /*!< DSD GLOBRC: CH3RUN (Bit 3)                                  */
#define DSD_GLOBRC_CH3RUN_Msk                 (0x8UL)                   /*!< DSD GLOBRC: CH3RUN (Bitfield-Mask: 0x01)                    */

/* ----------------------------------  DSD_CGCFG  --------------------------------- */
#define DSD_CGCFG_CGMOD_Pos                   (0UL)                     /*!< DSD CGCFG: CGMOD (Bit 0)                                    */
#define DSD_CGCFG_CGMOD_Msk                   (0x3UL)                   /*!< DSD CGCFG: CGMOD (Bitfield-Mask: 0x03)                      */
#define DSD_CGCFG_BREV_Pos                    (2UL)                     /*!< DSD CGCFG: BREV (Bit 2)                                     */
#define DSD_CGCFG_BREV_Msk                    (0x4UL)                   /*!< DSD CGCFG: BREV (Bitfield-Mask: 0x01)                       */
#define DSD_CGCFG_SIGPOL_Pos                  (3UL)                     /*!< DSD CGCFG: SIGPOL (Bit 3)                                   */
#define DSD_CGCFG_SIGPOL_Msk                  (0x8UL)                   /*!< DSD CGCFG: SIGPOL (Bitfield-Mask: 0x01)                     */
#define DSD_CGCFG_DIVCG_Pos                   (4UL)                     /*!< DSD CGCFG: DIVCG (Bit 4)                                    */
#define DSD_CGCFG_DIVCG_Msk                   (0xf0UL)                  /*!< DSD CGCFG: DIVCG (Bitfield-Mask: 0x0f)                      */
#define DSD_CGCFG_RUN_Pos                     (15UL)                    /*!< DSD CGCFG: RUN (Bit 15)                                     */
#define DSD_CGCFG_RUN_Msk                     (0x8000UL)                /*!< DSD CGCFG: RUN (Bitfield-Mask: 0x01)                        */
#define DSD_CGCFG_BITCOUNT_Pos                (16UL)                    /*!< DSD CGCFG: BITCOUNT (Bit 16)                                */
#define DSD_CGCFG_BITCOUNT_Msk                (0x1f0000UL)              /*!< DSD CGCFG: BITCOUNT (Bitfield-Mask: 0x1f)                   */
#define DSD_CGCFG_STEPCOUNT_Pos               (24UL)                    /*!< DSD CGCFG: STEPCOUNT (Bit 24)                               */
#define DSD_CGCFG_STEPCOUNT_Msk               (0xf000000UL)             /*!< DSD CGCFG: STEPCOUNT (Bitfield-Mask: 0x0f)                  */
#define DSD_CGCFG_STEPS_Pos                   (28UL)                    /*!< DSD CGCFG: STEPS (Bit 28)                                   */
#define DSD_CGCFG_STEPS_Msk                   (0x10000000UL)            /*!< DSD CGCFG: STEPS (Bitfield-Mask: 0x01)                      */
#define DSD_CGCFG_STEPD_Pos                   (29UL)                    /*!< DSD CGCFG: STEPD (Bit 29)                                   */
#define DSD_CGCFG_STEPD_Msk                   (0x20000000UL)            /*!< DSD CGCFG: STEPD (Bitfield-Mask: 0x01)                      */
#define DSD_CGCFG_SGNCG_Pos                   (30UL)                    /*!< DSD CGCFG: SGNCG (Bit 30)                                   */
#define DSD_CGCFG_SGNCG_Msk                   (0x40000000UL)            /*!< DSD CGCFG: SGNCG (Bitfield-Mask: 0x01)                      */

/* ---------------------------------  DSD_EVFLAG  --------------------------------- */
#define DSD_EVFLAG_RESEV0_Pos                 (0UL)                     /*!< DSD EVFLAG: RESEV0 (Bit 0)                                  */
#define DSD_EVFLAG_RESEV0_Msk                 (0x1UL)                   /*!< DSD EVFLAG: RESEV0 (Bitfield-Mask: 0x01)                    */
#define DSD_EVFLAG_RESEV1_Pos                 (1UL)                     /*!< DSD EVFLAG: RESEV1 (Bit 1)                                  */
#define DSD_EVFLAG_RESEV1_Msk                 (0x2UL)                   /*!< DSD EVFLAG: RESEV1 (Bitfield-Mask: 0x01)                    */
#define DSD_EVFLAG_RESEV2_Pos                 (2UL)                     /*!< DSD EVFLAG: RESEV2 (Bit 2)                                  */
#define DSD_EVFLAG_RESEV2_Msk                 (0x4UL)                   /*!< DSD EVFLAG: RESEV2 (Bitfield-Mask: 0x01)                    */
#define DSD_EVFLAG_RESEV3_Pos                 (3UL)                     /*!< DSD EVFLAG: RESEV3 (Bit 3)                                  */
#define DSD_EVFLAG_RESEV3_Msk                 (0x8UL)                   /*!< DSD EVFLAG: RESEV3 (Bitfield-Mask: 0x01)                    */
#define DSD_EVFLAG_ALEV0_Pos                  (16UL)                    /*!< DSD EVFLAG: ALEV0 (Bit 16)                                  */
#define DSD_EVFLAG_ALEV0_Msk                  (0x10000UL)               /*!< DSD EVFLAG: ALEV0 (Bitfield-Mask: 0x01)                     */
#define DSD_EVFLAG_ALEV1_Pos                  (17UL)                    /*!< DSD EVFLAG: ALEV1 (Bit 17)                                  */
#define DSD_EVFLAG_ALEV1_Msk                  (0x20000UL)               /*!< DSD EVFLAG: ALEV1 (Bitfield-Mask: 0x01)                     */
#define DSD_EVFLAG_ALEV2_Pos                  (18UL)                    /*!< DSD EVFLAG: ALEV2 (Bit 18)                                  */
#define DSD_EVFLAG_ALEV2_Msk                  (0x40000UL)               /*!< DSD EVFLAG: ALEV2 (Bitfield-Mask: 0x01)                     */
#define DSD_EVFLAG_ALEV3_Pos                  (19UL)                    /*!< DSD EVFLAG: ALEV3 (Bit 19)                                  */
#define DSD_EVFLAG_ALEV3_Msk                  (0x80000UL)               /*!< DSD EVFLAG: ALEV3 (Bitfield-Mask: 0x01)                     */
#define DSD_EVFLAG_ALEV4_Pos                  (20UL)                    /*!< DSD EVFLAG: ALEV4 (Bit 20)                                  */
#define DSD_EVFLAG_ALEV4_Msk                  (0x100000UL)              /*!< DSD EVFLAG: ALEV4 (Bitfield-Mask: 0x01)                     */
#define DSD_EVFLAG_ALEV5_Pos                  (21UL)                    /*!< DSD EVFLAG: ALEV5 (Bit 21)                                  */
#define DSD_EVFLAG_ALEV5_Msk                  (0x200000UL)              /*!< DSD EVFLAG: ALEV5 (Bitfield-Mask: 0x01)                     */
#define DSD_EVFLAG_ALEV6_Pos                  (22UL)                    /*!< DSD EVFLAG: ALEV6 (Bit 22)                                  */
#define DSD_EVFLAG_ALEV6_Msk                  (0x400000UL)              /*!< DSD EVFLAG: ALEV6 (Bitfield-Mask: 0x01)                     */
#define DSD_EVFLAG_ALEV7_Pos                  (23UL)                    /*!< DSD EVFLAG: ALEV7 (Bit 23)                                  */
#define DSD_EVFLAG_ALEV7_Msk                  (0x800000UL)              /*!< DSD EVFLAG: ALEV7 (Bitfield-Mask: 0x01)                     */
#define DSD_EVFLAG_ALEV8_Pos                  (24UL)                    /*!< DSD EVFLAG: ALEV8 (Bit 24)                                  */
#define DSD_EVFLAG_ALEV8_Msk                  (0x1000000UL)             /*!< DSD EVFLAG: ALEV8 (Bitfield-Mask: 0x01)                     */
#define DSD_EVFLAG_ALEV9_Pos                  (25UL)                    /*!< DSD EVFLAG: ALEV9 (Bit 25)                                  */
#define DSD_EVFLAG_ALEV9_Msk                  (0x2000000UL)             /*!< DSD EVFLAG: ALEV9 (Bitfield-Mask: 0x01)                     */

/* --------------------------------  DSD_EVFLAGCLR  ------------------------------- */
#define DSD_EVFLAGCLR_RESEC0_Pos              (0UL)                     /*!< DSD EVFLAGCLR: RESEC0 (Bit 0)                               */
#define DSD_EVFLAGCLR_RESEC0_Msk              (0x1UL)                   /*!< DSD EVFLAGCLR: RESEC0 (Bitfield-Mask: 0x01)                 */
#define DSD_EVFLAGCLR_RESEC1_Pos              (1UL)                     /*!< DSD EVFLAGCLR: RESEC1 (Bit 1)                               */
#define DSD_EVFLAGCLR_RESEC1_Msk              (0x2UL)                   /*!< DSD EVFLAGCLR: RESEC1 (Bitfield-Mask: 0x01)                 */
#define DSD_EVFLAGCLR_RESEC2_Pos              (2UL)                     /*!< DSD EVFLAGCLR: RESEC2 (Bit 2)                               */
#define DSD_EVFLAGCLR_RESEC2_Msk              (0x4UL)                   /*!< DSD EVFLAGCLR: RESEC2 (Bitfield-Mask: 0x01)                 */
#define DSD_EVFLAGCLR_RESEC3_Pos              (3UL)                     /*!< DSD EVFLAGCLR: RESEC3 (Bit 3)                               */
#define DSD_EVFLAGCLR_RESEC3_Msk              (0x8UL)                   /*!< DSD EVFLAGCLR: RESEC3 (Bitfield-Mask: 0x01)                 */
#define DSD_EVFLAGCLR_ALEC0_Pos               (16UL)                    /*!< DSD EVFLAGCLR: ALEC0 (Bit 16)                               */
#define DSD_EVFLAGCLR_ALEC0_Msk               (0x10000UL)               /*!< DSD EVFLAGCLR: ALEC0 (Bitfield-Mask: 0x01)                  */
#define DSD_EVFLAGCLR_ALEC1_Pos               (17UL)                    /*!< DSD EVFLAGCLR: ALEC1 (Bit 17)                               */
#define DSD_EVFLAGCLR_ALEC1_Msk               (0x20000UL)               /*!< DSD EVFLAGCLR: ALEC1 (Bitfield-Mask: 0x01)                  */
#define DSD_EVFLAGCLR_ALEC2_Pos               (18UL)                    /*!< DSD EVFLAGCLR: ALEC2 (Bit 18)                               */
#define DSD_EVFLAGCLR_ALEC2_Msk               (0x40000UL)               /*!< DSD EVFLAGCLR: ALEC2 (Bitfield-Mask: 0x01)                  */
#define DSD_EVFLAGCLR_ALEC3_Pos               (19UL)                    /*!< DSD EVFLAGCLR: ALEC3 (Bit 19)                               */
#define DSD_EVFLAGCLR_ALEC3_Msk               (0x80000UL)               /*!< DSD EVFLAGCLR: ALEC3 (Bitfield-Mask: 0x01)                  */


/* ================================================================================ */
/* ================         Group 'DSD_CH' Position & Mask         ================ */
/* ================================================================================ */


/* --------------------------------  DSD_CH_MODCFG  ------------------------------- */
#define DSD_CH_MODCFG_DIVM_Pos                (16UL)                    /*!< DSD_CH MODCFG: DIVM (Bit 16)                                */
#define DSD_CH_MODCFG_DIVM_Msk                (0xf0000UL)               /*!< DSD_CH MODCFG: DIVM (Bitfield-Mask: 0x0f)                   */
#define DSD_CH_MODCFG_DWC_Pos                 (23UL)                    /*!< DSD_CH MODCFG: DWC (Bit 23)                                 */
#define DSD_CH_MODCFG_DWC_Msk                 (0x800000UL)              /*!< DSD_CH MODCFG: DWC (Bitfield-Mask: 0x01)                    */

/* --------------------------------  DSD_CH_DICFG  -------------------------------- */
#define DSD_CH_DICFG_DSRC_Pos                 (0UL)                     /*!< DSD_CH DICFG: DSRC (Bit 0)                                  */
#define DSD_CH_DICFG_DSRC_Msk                 (0xfUL)                   /*!< DSD_CH DICFG: DSRC (Bitfield-Mask: 0x0f)                    */
#define DSD_CH_DICFG_DSWC_Pos                 (7UL)                     /*!< DSD_CH DICFG: DSWC (Bit 7)                                  */
#define DSD_CH_DICFG_DSWC_Msk                 (0x80UL)                  /*!< DSD_CH DICFG: DSWC (Bitfield-Mask: 0x01)                    */
#define DSD_CH_DICFG_ITRMODE_Pos              (8UL)                     /*!< DSD_CH DICFG: ITRMODE (Bit 8)                               */
#define DSD_CH_DICFG_ITRMODE_Msk              (0x300UL)                 /*!< DSD_CH DICFG: ITRMODE (Bitfield-Mask: 0x03)                 */
#define DSD_CH_DICFG_TSTRMODE_Pos             (10UL)                    /*!< DSD_CH DICFG: TSTRMODE (Bit 10)                             */
#define DSD_CH_DICFG_TSTRMODE_Msk             (0xc00UL)                 /*!< DSD_CH DICFG: TSTRMODE (Bitfield-Mask: 0x03)                */
#define DSD_CH_DICFG_TRSEL_Pos                (12UL)                    /*!< DSD_CH DICFG: TRSEL (Bit 12)                                */
#define DSD_CH_DICFG_TRSEL_Msk                (0x7000UL)                /*!< DSD_CH DICFG: TRSEL (Bitfield-Mask: 0x07)                   */
#define DSD_CH_DICFG_TRWC_Pos                 (15UL)                    /*!< DSD_CH DICFG: TRWC (Bit 15)                                 */
#define DSD_CH_DICFG_TRWC_Msk                 (0x8000UL)                /*!< DSD_CH DICFG: TRWC (Bitfield-Mask: 0x01)                    */
#define DSD_CH_DICFG_CSRC_Pos                 (16UL)                    /*!< DSD_CH DICFG: CSRC (Bit 16)                                 */
#define DSD_CH_DICFG_CSRC_Msk                 (0xf0000UL)               /*!< DSD_CH DICFG: CSRC (Bitfield-Mask: 0x0f)                    */
#define DSD_CH_DICFG_STROBE_Pos               (20UL)                    /*!< DSD_CH DICFG: STROBE (Bit 20)                               */
#define DSD_CH_DICFG_STROBE_Msk               (0xf00000UL)              /*!< DSD_CH DICFG: STROBE (Bitfield-Mask: 0x0f)                  */
#define DSD_CH_DICFG_SCWC_Pos                 (31UL)                    /*!< DSD_CH DICFG: SCWC (Bit 31)                                 */
#define DSD_CH_DICFG_SCWC_Msk                 (0x80000000UL)            /*!< DSD_CH DICFG: SCWC (Bitfield-Mask: 0x01)                    */

/* --------------------------------  DSD_CH_FCFGC  -------------------------------- */
#define DSD_CH_FCFGC_CFMDF_Pos                (0UL)                     /*!< DSD_CH FCFGC: CFMDF (Bit 0)                                 */
#define DSD_CH_FCFGC_CFMDF_Msk                (0xffUL)                  /*!< DSD_CH FCFGC: CFMDF (Bitfield-Mask: 0xff)                   */
#define DSD_CH_FCFGC_CFMC_Pos                 (8UL)                     /*!< DSD_CH FCFGC: CFMC (Bit 8)                                  */
#define DSD_CH_FCFGC_CFMC_Msk                 (0x300UL)                 /*!< DSD_CH FCFGC: CFMC (Bitfield-Mask: 0x03)                    */
#define DSD_CH_FCFGC_CFEN_Pos                 (10UL)                    /*!< DSD_CH FCFGC: CFEN (Bit 10)                                 */
#define DSD_CH_FCFGC_CFEN_Msk                 (0x400UL)                 /*!< DSD_CH FCFGC: CFEN (Bitfield-Mask: 0x01)                    */
#define DSD_CH_FCFGC_SRGM_Pos                 (14UL)                    /*!< DSD_CH FCFGC: SRGM (Bit 14)                                 */
#define DSD_CH_FCFGC_SRGM_Msk                 (0xc000UL)                /*!< DSD_CH FCFGC: SRGM (Bitfield-Mask: 0x03)                    */
#define DSD_CH_FCFGC_CFMSV_Pos                (16UL)                    /*!< DSD_CH FCFGC: CFMSV (Bit 16)                                */
#define DSD_CH_FCFGC_CFMSV_Msk                (0xff0000UL)              /*!< DSD_CH FCFGC: CFMSV (Bitfield-Mask: 0xff)                   */
#define DSD_CH_FCFGC_CFMDCNT_Pos              (24UL)                    /*!< DSD_CH FCFGC: CFMDCNT (Bit 24)                              */
#define DSD_CH_FCFGC_CFMDCNT_Msk              (0xff000000UL)            /*!< DSD_CH FCFGC: CFMDCNT (Bitfield-Mask: 0xff)                 */

/* --------------------------------  DSD_CH_FCFGA  -------------------------------- */
#define DSD_CH_FCFGA_CFADF_Pos                (0UL)                     /*!< DSD_CH FCFGA: CFADF (Bit 0)                                 */
#define DSD_CH_FCFGA_CFADF_Msk                (0xffUL)                  /*!< DSD_CH FCFGA: CFADF (Bitfield-Mask: 0xff)                   */
#define DSD_CH_FCFGA_CFAC_Pos                 (8UL)                     /*!< DSD_CH FCFGA: CFAC (Bit 8)                                  */
#define DSD_CH_FCFGA_CFAC_Msk                 (0x300UL)                 /*!< DSD_CH FCFGA: CFAC (Bitfield-Mask: 0x03)                    */
#define DSD_CH_FCFGA_SRGA_Pos                 (10UL)                    /*!< DSD_CH FCFGA: SRGA (Bit 10)                                 */
#define DSD_CH_FCFGA_SRGA_Msk                 (0xc00UL)                 /*!< DSD_CH FCFGA: SRGA (Bitfield-Mask: 0x03)                    */
#define DSD_CH_FCFGA_ESEL_Pos                 (12UL)                    /*!< DSD_CH FCFGA: ESEL (Bit 12)                                 */
#define DSD_CH_FCFGA_ESEL_Msk                 (0x3000UL)                /*!< DSD_CH FCFGA: ESEL (Bitfield-Mask: 0x03)                    */
#define DSD_CH_FCFGA_EGT_Pos                  (14UL)                    /*!< DSD_CH FCFGA: EGT (Bit 14)                                  */
#define DSD_CH_FCFGA_EGT_Msk                  (0x4000UL)                /*!< DSD_CH FCFGA: EGT (Bitfield-Mask: 0x01)                     */
#define DSD_CH_FCFGA_CFADCNT_Pos              (24UL)                    /*!< DSD_CH FCFGA: CFADCNT (Bit 24)                              */
#define DSD_CH_FCFGA_CFADCNT_Msk              (0xff000000UL)            /*!< DSD_CH FCFGA: CFADCNT (Bitfield-Mask: 0xff)                 */

