MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4502-F100K768/mcu.h
/* ---------------------------------  PORT6_IOCR4  -------------------------------- */
#define PORT6_IOCR4_PC4_Pos                   (3UL)                     /*!< PORT6 IOCR4: PC4 (Bit 3)                                    */
#define PORT6_IOCR4_PC4_Msk                   (0xf8UL)                  /*!< PORT6 IOCR4: PC4 (Bitfield-Mask: 0x1f)                      */
#define PORT6_IOCR4_PC5_Pos                   (11UL)                    /*!< PORT6 IOCR4: PC5 (Bit 11)                                   */
#define PORT6_IOCR4_PC5_Msk                   (0xf800UL)                /*!< PORT6 IOCR4: PC5 (Bitfield-Mask: 0x1f)                      */
#define PORT6_IOCR4_PC6_Pos                   (19UL)                    /*!< PORT6 IOCR4: PC6 (Bit 19)                                   */
#define PORT6_IOCR4_PC6_Msk                   (0xf80000UL)              /*!< PORT6 IOCR4: PC6 (Bitfield-Mask: 0x1f)                      */
#define PORT6_IOCR4_PC7_Pos                   (27UL)                    /*!< PORT6 IOCR4: PC7 (Bit 27)                                   */
#define PORT6_IOCR4_PC7_Msk                   (0xf8000000UL)            /*!< PORT6 IOCR4: PC7 (Bitfield-Mask: 0x1f)                      */

/* ----------------------------------  PORT6_IN  ---------------------------------- */
#define PORT6_IN_P0_Pos                       (0UL)                     /*!< PORT6 IN: P0 (Bit 0)                                        */
#define PORT6_IN_P0_Msk                       (0x1UL)                   /*!< PORT6 IN: P0 (Bitfield-Mask: 0x01)                          */
#define PORT6_IN_P1_Pos                       (1UL)                     /*!< PORT6 IN: P1 (Bit 1)                                        */
#define PORT6_IN_P1_Msk                       (0x2UL)                   /*!< PORT6 IN: P1 (Bitfield-Mask: 0x01)                          */
#define PORT6_IN_P2_Pos                       (2UL)                     /*!< PORT6 IN: P2 (Bit 2)                                        */
#define PORT6_IN_P2_Msk                       (0x4UL)                   /*!< PORT6 IN: P2 (Bitfield-Mask: 0x01)                          */
#define PORT6_IN_P3_Pos                       (3UL)                     /*!< PORT6 IN: P3 (Bit 3)                                        */
#define PORT6_IN_P3_Msk                       (0x8UL)                   /*!< PORT6 IN: P3 (Bitfield-Mask: 0x01)                          */
#define PORT6_IN_P4_Pos                       (4UL)                     /*!< PORT6 IN: P4 (Bit 4)                                        */
#define PORT6_IN_P4_Msk                       (0x10UL)                  /*!< PORT6 IN: P4 (Bitfield-Mask: 0x01)                          */
#define PORT6_IN_P5_Pos                       (5UL)                     /*!< PORT6 IN: P5 (Bit 5)                                        */
#define PORT6_IN_P5_Msk                       (0x20UL)                  /*!< PORT6 IN: P5 (Bitfield-Mask: 0x01)                          */
#define PORT6_IN_P6_Pos                       (6UL)                     /*!< PORT6 IN: P6 (Bit 6)                                        */
#define PORT6_IN_P6_Msk                       (0x40UL)                  /*!< PORT6 IN: P6 (Bitfield-Mask: 0x01)                          */
#define PORT6_IN_P7_Pos                       (7UL)                     /*!< PORT6 IN: P7 (Bit 7)                                        */
#define PORT6_IN_P7_Msk                       (0x80UL)                  /*!< PORT6 IN: P7 (Bitfield-Mask: 0x01)                          */
#define PORT6_IN_P8_Pos                       (8UL)                     /*!< PORT6 IN: P8 (Bit 8)                                        */
#define PORT6_IN_P8_Msk                       (0x100UL)                 /*!< PORT6 IN: P8 (Bitfield-Mask: 0x01)                          */
#define PORT6_IN_P9_Pos                       (9UL)                     /*!< PORT6 IN: P9 (Bit 9)                                        */
#define PORT6_IN_P9_Msk                       (0x200UL)                 /*!< PORT6 IN: P9 (Bitfield-Mask: 0x01)                          */
#define PORT6_IN_P10_Pos                      (10UL)                    /*!< PORT6 IN: P10 (Bit 10)                                      */
#define PORT6_IN_P10_Msk                      (0x400UL)                 /*!< PORT6 IN: P10 (Bitfield-Mask: 0x01)                         */
#define PORT6_IN_P11_Pos                      (11UL)                    /*!< PORT6 IN: P11 (Bit 11)                                      */
#define PORT6_IN_P11_Msk                      (0x800UL)                 /*!< PORT6 IN: P11 (Bitfield-Mask: 0x01)                         */
#define PORT6_IN_P12_Pos                      (12UL)                    /*!< PORT6 IN: P12 (Bit 12)                                      */
#define PORT6_IN_P12_Msk                      (0x1000UL)                /*!< PORT6 IN: P12 (Bitfield-Mask: 0x01)                         */
#define PORT6_IN_P13_Pos                      (13UL)                    /*!< PORT6 IN: P13 (Bit 13)                                      */
#define PORT6_IN_P13_Msk                      (0x2000UL)                /*!< PORT6 IN: P13 (Bitfield-Mask: 0x01)                         */
#define PORT6_IN_P14_Pos                      (14UL)                    /*!< PORT6 IN: P14 (Bit 14)                                      */
#define PORT6_IN_P14_Msk                      (0x4000UL)                /*!< PORT6 IN: P14 (Bitfield-Mask: 0x01)                         */
#define PORT6_IN_P15_Pos                      (15UL)                    /*!< PORT6 IN: P15 (Bit 15)                                      */
#define PORT6_IN_P15_Msk                      (0x8000UL)                /*!< PORT6 IN: P15 (Bitfield-Mask: 0x01)                         */

/* ---------------------------------  PORT6_PDR0  --------------------------------- */
#define PORT6_PDR0_PD0_Pos                    (0UL)                     /*!< PORT6 PDR0: PD0 (Bit 0)                                     */
#define PORT6_PDR0_PD0_Msk                    (0x7UL)                   /*!< PORT6 PDR0: PD0 (Bitfield-Mask: 0x07)                       */
#define PORT6_PDR0_PD1_Pos                    (4UL)                     /*!< PORT6 PDR0: PD1 (Bit 4)                                     */
#define PORT6_PDR0_PD1_Msk                    (0x70UL)                  /*!< PORT6 PDR0: PD1 (Bitfield-Mask: 0x07)                       */
#define PORT6_PDR0_PD2_Pos                    (8UL)                     /*!< PORT6 PDR0: PD2 (Bit 8)                                     */
#define PORT6_PDR0_PD2_Msk                    (0x700UL)                 /*!< PORT6 PDR0: PD2 (Bitfield-Mask: 0x07)                       */
#define PORT6_PDR0_PD3_Pos                    (12UL)                    /*!< PORT6 PDR0: PD3 (Bit 12)                                    */
#define PORT6_PDR0_PD3_Msk                    (0x7000UL)                /*!< PORT6 PDR0: PD3 (Bitfield-Mask: 0x07)                       */
#define PORT6_PDR0_PD4_Pos                    (16UL)                    /*!< PORT6 PDR0: PD4 (Bit 16)                                    */
#define PORT6_PDR0_PD4_Msk                    (0x70000UL)               /*!< PORT6 PDR0: PD4 (Bitfield-Mask: 0x07)                       */
#define PORT6_PDR0_PD5_Pos                    (20UL)                    /*!< PORT6 PDR0: PD5 (Bit 20)                                    */
#define PORT6_PDR0_PD5_Msk                    (0x700000UL)              /*!< PORT6 PDR0: PD5 (Bitfield-Mask: 0x07)                       */
#define PORT6_PDR0_PD6_Pos                    (24UL)                    /*!< PORT6 PDR0: PD6 (Bit 24)                                    */
#define PORT6_PDR0_PD6_Msk                    (0x7000000UL)             /*!< PORT6 PDR0: PD6 (Bitfield-Mask: 0x07)                       */
#define PORT6_PDR0_PD7_Pos                    (28UL)                    /*!< PORT6 PDR0: PD7 (Bit 28)                                    */
#define PORT6_PDR0_PD7_Msk                    (0x70000000UL)            /*!< PORT6 PDR0: PD7 (Bitfield-Mask: 0x07)                       */

/* ---------------------------------  PORT6_PDISC  -------------------------------- */
#define PORT6_PDISC_PDIS0_Pos                 (0UL)                     /*!< PORT6 PDISC: PDIS0 (Bit 0)                                  */
#define PORT6_PDISC_PDIS0_Msk                 (0x1UL)                   /*!< PORT6 PDISC: PDIS0 (Bitfield-Mask: 0x01)                    */
#define PORT6_PDISC_PDIS1_Pos                 (1UL)                     /*!< PORT6 PDISC: PDIS1 (Bit 1)                                  */
#define PORT6_PDISC_PDIS1_Msk                 (0x2UL)                   /*!< PORT6 PDISC: PDIS1 (Bitfield-Mask: 0x01)                    */
#define PORT6_PDISC_PDIS2_Pos                 (2UL)                     /*!< PORT6 PDISC: PDIS2 (Bit 2)                                  */
#define PORT6_PDISC_PDIS2_Msk                 (0x4UL)                   /*!< PORT6 PDISC: PDIS2 (Bitfield-Mask: 0x01)                    */
#define PORT6_PDISC_PDIS3_Pos                 (3UL)                     /*!< PORT6 PDISC: PDIS3 (Bit 3)                                  */
#define PORT6_PDISC_PDIS3_Msk                 (0x8UL)                   /*!< PORT6 PDISC: PDIS3 (Bitfield-Mask: 0x01)                    */
#define PORT6_PDISC_PDIS4_Pos                 (4UL)                     /*!< PORT6 PDISC: PDIS4 (Bit 4)                                  */
#define PORT6_PDISC_PDIS4_Msk                 (0x10UL)                  /*!< PORT6 PDISC: PDIS4 (Bitfield-Mask: 0x01)                    */
#define PORT6_PDISC_PDIS5_Pos                 (5UL)                     /*!< PORT6 PDISC: PDIS5 (Bit 5)                                  */
#define PORT6_PDISC_PDIS5_Msk                 (0x20UL)                  /*!< PORT6 PDISC: PDIS5 (Bitfield-Mask: 0x01)                    */
#define PORT6_PDISC_PDIS6_Pos                 (6UL)                     /*!< PORT6 PDISC: PDIS6 (Bit 6)                                  */
#define PORT6_PDISC_PDIS6_Msk                 (0x40UL)                  /*!< PORT6 PDISC: PDIS6 (Bitfield-Mask: 0x01)                    */
#define PORT6_PDISC_PDIS7_Pos                 (7UL)                     /*!< PORT6 PDISC: PDIS7 (Bit 7)                                  */
#define PORT6_PDISC_PDIS7_Msk                 (0x80UL)                  /*!< PORT6 PDISC: PDIS7 (Bitfield-Mask: 0x01)                    */
#define PORT6_PDISC_PDIS8_Pos                 (8UL)                     /*!< PORT6 PDISC: PDIS8 (Bit 8)                                  */
#define PORT6_PDISC_PDIS8_Msk                 (0x100UL)                 /*!< PORT6 PDISC: PDIS8 (Bitfield-Mask: 0x01)                    */
#define PORT6_PDISC_PDIS9_Pos                 (9UL)                     /*!< PORT6 PDISC: PDIS9 (Bit 9)                                  */
#define PORT6_PDISC_PDIS9_Msk                 (0x200UL)                 /*!< PORT6 PDISC: PDIS9 (Bitfield-Mask: 0x01)                    */
#define PORT6_PDISC_PDIS10_Pos                (10UL)                    /*!< PORT6 PDISC: PDIS10 (Bit 10)                                */
#define PORT6_PDISC_PDIS10_Msk                (0x400UL)                 /*!< PORT6 PDISC: PDIS10 (Bitfield-Mask: 0x01)                   */
#define PORT6_PDISC_PDIS11_Pos                (11UL)                    /*!< PORT6 PDISC: PDIS11 (Bit 11)                                */
#define PORT6_PDISC_PDIS11_Msk                (0x800UL)                 /*!< PORT6 PDISC: PDIS11 (Bitfield-Mask: 0x01)                   */
#define PORT6_PDISC_PDIS12_Pos                (12UL)                    /*!< PORT6 PDISC: PDIS12 (Bit 12)                                */
#define PORT6_PDISC_PDIS12_Msk                (0x1000UL)                /*!< PORT6 PDISC: PDIS12 (Bitfield-Mask: 0x01)                   */
#define PORT6_PDISC_PDIS13_Pos                (13UL)                    /*!< PORT6 PDISC: PDIS13 (Bit 13)                                */
#define PORT6_PDISC_PDIS13_Msk                (0x2000UL)                /*!< PORT6 PDISC: PDIS13 (Bitfield-Mask: 0x01)                   */
#define PORT6_PDISC_PDIS14_Pos                (14UL)                    /*!< PORT6 PDISC: PDIS14 (Bit 14)                                */
#define PORT6_PDISC_PDIS14_Msk                (0x4000UL)                /*!< PORT6 PDISC: PDIS14 (Bitfield-Mask: 0x01)                   */
#define PORT6_PDISC_PDIS15_Pos                (15UL)                    /*!< PORT6 PDISC: PDIS15 (Bit 15)                                */
#define PORT6_PDISC_PDIS15_Msk                (0x8000UL)                /*!< PORT6 PDISC: PDIS15 (Bitfield-Mask: 0x01)                   */

/* ----------------------------------  PORT6_PPS  --------------------------------- */
#define PORT6_PPS_PPS0_Pos                    (0UL)                     /*!< PORT6 PPS: PPS0 (Bit 0)                                     */
#define PORT6_PPS_PPS0_Msk                    (0x1UL)                   /*!< PORT6 PPS: PPS0 (Bitfield-Mask: 0x01)                       */
#define PORT6_PPS_PPS1_Pos                    (1UL)                     /*!< PORT6 PPS: PPS1 (Bit 1)                                     */
#define PORT6_PPS_PPS1_Msk                    (0x2UL)                   /*!< PORT6 PPS: PPS1 (Bitfield-Mask: 0x01)                       */
#define PORT6_PPS_PPS2_Pos                    (2UL)                     /*!< PORT6 PPS: PPS2 (Bit 2)                                     */
#define PORT6_PPS_PPS2_Msk                    (0x4UL)                   /*!< PORT6 PPS: PPS2 (Bitfield-Mask: 0x01)                       */
#define PORT6_PPS_PPS3_Pos                    (3UL)                     /*!< PORT6 PPS: PPS3 (Bit 3)                                     */
#define PORT6_PPS_PPS3_Msk                    (0x8UL)                   /*!< PORT6 PPS: PPS3 (Bitfield-Mask: 0x01)                       */
#define PORT6_PPS_PPS4_Pos                    (4UL)                     /*!< PORT6 PPS: PPS4 (Bit 4)                                     */
#define PORT6_PPS_PPS4_Msk                    (0x10UL)                  /*!< PORT6 PPS: PPS4 (Bitfield-Mask: 0x01)                       */
#define PORT6_PPS_PPS5_Pos                    (5UL)                     /*!< PORT6 PPS: PPS5 (Bit 5)                                     */
#define PORT6_PPS_PPS5_Msk                    (0x20UL)                  /*!< PORT6 PPS: PPS5 (Bitfield-Mask: 0x01)                       */
#define PORT6_PPS_PPS6_Pos                    (6UL)                     /*!< PORT6 PPS: PPS6 (Bit 6)                                     */
#define PORT6_PPS_PPS6_Msk                    (0x40UL)                  /*!< PORT6 PPS: PPS6 (Bitfield-Mask: 0x01)                       */
#define PORT6_PPS_PPS7_Pos                    (7UL)                     /*!< PORT6 PPS: PPS7 (Bit 7)                                     */
#define PORT6_PPS_PPS7_Msk                    (0x80UL)                  /*!< PORT6 PPS: PPS7 (Bitfield-Mask: 0x01)                       */
#define PORT6_PPS_PPS8_Pos                    (8UL)                     /*!< PORT6 PPS: PPS8 (Bit 8)                                     */
#define PORT6_PPS_PPS8_Msk                    (0x100UL)                 /*!< PORT6 PPS: PPS8 (Bitfield-Mask: 0x01)                       */
#define PORT6_PPS_PPS9_Pos                    (9UL)                     /*!< PORT6 PPS: PPS9 (Bit 9)                                     */
#define PORT6_PPS_PPS9_Msk                    (0x200UL)                 /*!< PORT6 PPS: PPS9 (Bitfield-Mask: 0x01)                       */
#define PORT6_PPS_PPS10_Pos                   (10UL)                    /*!< PORT6 PPS: PPS10 (Bit 10)                                   */
#define PORT6_PPS_PPS10_Msk                   (0x400UL)                 /*!< PORT6 PPS: PPS10 (Bitfield-Mask: 0x01)                      */
#define PORT6_PPS_PPS11_Pos                   (11UL)                    /*!< PORT6 PPS: PPS11 (Bit 11)                                   */
#define PORT6_PPS_PPS11_Msk                   (0x800UL)                 /*!< PORT6 PPS: PPS11 (Bitfield-Mask: 0x01)                      */
#define PORT6_PPS_PPS12_Pos                   (12UL)                    /*!< PORT6 PPS: PPS12 (Bit 12)                                   */
#define PORT6_PPS_PPS12_Msk                   (0x1000UL)                /*!< PORT6 PPS: PPS12 (Bitfield-Mask: 0x01)                      */
#define PORT6_PPS_PPS13_Pos                   (13UL)                    /*!< PORT6 PPS: PPS13 (Bit 13)                                   */
#define PORT6_PPS_PPS13_Msk                   (0x2000UL)                /*!< PORT6 PPS: PPS13 (Bitfield-Mask: 0x01)                      */
#define PORT6_PPS_PPS14_Pos                   (14UL)                    /*!< PORT6 PPS: PPS14 (Bit 14)                                   */
#define PORT6_PPS_PPS14_Msk                   (0x4000UL)                /*!< PORT6 PPS: PPS14 (Bitfield-Mask: 0x01)                      */
#define PORT6_PPS_PPS15_Pos                   (15UL)                    /*!< PORT6 PPS: PPS15 (Bit 15)                                   */
#define PORT6_PPS_PPS15_Msk                   (0x8000UL)                /*!< PORT6 PPS: PPS15 (Bitfield-Mask: 0x01)                      */

/* ---------------------------------  PORT6_HWSEL  -------------------------------- */
#define PORT6_HWSEL_HW0_Pos                   (0UL)                     /*!< PORT6 HWSEL: HW0 (Bit 0)                                    */
#define PORT6_HWSEL_HW0_Msk                   (0x3UL)                   /*!< PORT6 HWSEL: HW0 (Bitfield-Mask: 0x03)                      */
#define PORT6_HWSEL_HW1_Pos                   (2UL)                     /*!< PORT6 HWSEL: HW1 (Bit 2)                                    */
#define PORT6_HWSEL_HW1_Msk                   (0xcUL)                   /*!< PORT6 HWSEL: HW1 (Bitfield-Mask: 0x03)                      */
#define PORT6_HWSEL_HW2_Pos                   (4UL)                     /*!< PORT6 HWSEL: HW2 (Bit 4)                                    */
#define PORT6_HWSEL_HW2_Msk                   (0x30UL)                  /*!< PORT6 HWSEL: HW2 (Bitfield-Mask: 0x03)                      */
#define PORT6_HWSEL_HW3_Pos                   (6UL)                     /*!< PORT6 HWSEL: HW3 (Bit 6)                                    */
#define PORT6_HWSEL_HW3_Msk                   (0xc0UL)                  /*!< PORT6 HWSEL: HW3 (Bitfield-Mask: 0x03)                      */
#define PORT6_HWSEL_HW4_Pos                   (8UL)                     /*!< PORT6 HWSEL: HW4 (Bit 8)                                    */
#define PORT6_HWSEL_HW4_Msk                   (0x300UL)                 /*!< PORT6 HWSEL: HW4 (Bitfield-Mask: 0x03)                      */
#define PORT6_HWSEL_HW5_Pos                   (10UL)                    /*!< PORT6 HWSEL: HW5 (Bit 10)                                   */
#define PORT6_HWSEL_HW5_Msk                   (0xc00UL)                 /*!< PORT6 HWSEL: HW5 (Bitfield-Mask: 0x03)                      */
#define PORT6_HWSEL_HW6_Pos                   (12UL)                    /*!< PORT6 HWSEL: HW6 (Bit 12)                                   */
#define PORT6_HWSEL_HW6_Msk                   (0x3000UL)                /*!< PORT6 HWSEL: HW6 (Bitfield-Mask: 0x03)                      */
#define PORT6_HWSEL_HW7_Pos                   (14UL)                    /*!< PORT6 HWSEL: HW7 (Bit 14)                                   */
#define PORT6_HWSEL_HW7_Msk                   (0xc000UL)                /*!< PORT6 HWSEL: HW7 (Bitfield-Mask: 0x03)                      */
#define PORT6_HWSEL_HW8_Pos                   (16UL)                    /*!< PORT6 HWSEL: HW8 (Bit 16)                                   */
#define PORT6_HWSEL_HW8_Msk                   (0x30000UL)               /*!< PORT6 HWSEL: HW8 (Bitfield-Mask: 0x03)                      */
#define PORT6_HWSEL_HW9_Pos                   (18UL)                    /*!< PORT6 HWSEL: HW9 (Bit 18)                                   */
#define PORT6_HWSEL_HW9_Msk                   (0xc0000UL)               /*!< PORT6 HWSEL: HW9 (Bitfield-Mask: 0x03)                      */
#define PORT6_HWSEL_HW10_Pos                  (20UL)                    /*!< PORT6 HWSEL: HW10 (Bit 20)                                  */
#define PORT6_HWSEL_HW10_Msk                  (0x300000UL)              /*!< PORT6 HWSEL: HW10 (Bitfield-Mask: 0x03)                     */
#define PORT6_HWSEL_HW11_Pos                  (22UL)                    /*!< PORT6 HWSEL: HW11 (Bit 22)                                  */
#define PORT6_HWSEL_HW11_Msk                  (0xc00000UL)              /*!< PORT6 HWSEL: HW11 (Bitfield-Mask: 0x03)                     */
#define PORT6_HWSEL_HW12_Pos                  (24UL)                    /*!< PORT6 HWSEL: HW12 (Bit 24)                                  */
#define PORT6_HWSEL_HW12_Msk                  (0x3000000UL)             /*!< PORT6 HWSEL: HW12 (Bitfield-Mask: 0x03)                     */
#define PORT6_HWSEL_HW13_Pos                  (26UL)                    /*!< PORT6 HWSEL: HW13 (Bit 26)                                  */
#define PORT6_HWSEL_HW13_Msk                  (0xc000000UL)             /*!< PORT6 HWSEL: HW13 (Bitfield-Mask: 0x03)                     */
#define PORT6_HWSEL_HW14_Pos                  (28UL)                    /*!< PORT6 HWSEL: HW14 (Bit 28)                                  */
#define PORT6_HWSEL_HW14_Msk                  (0x30000000UL)            /*!< PORT6 HWSEL: HW14 (Bitfield-Mask: 0x03)                     */
#define PORT6_HWSEL_HW15_Pos                  (30UL)                    /*!< PORT6 HWSEL: HW15 (Bit 30)                                  */
#define PORT6_HWSEL_HW15_Msk                  (0xc0000000UL)            /*!< PORT6 HWSEL: HW15 (Bitfield-Mask: 0x03)                     */


/* ================================================================================ */
/* ================         struct 'PORT14' Position & Mask        ================ */
/* ================================================================================ */


